tap "farion1231/ccswitch"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "nikitabobko/tap"
tap "steipete/tap"
tap "tsung-ju/iguanatexmac"
tap "tw93/tap"
tap "upa/tap"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Command-line tool to export and inspect local iMessage database
brew "imessage-exporter"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql@8.4"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Version manager with support for Java, Node.js, Flutter, .NET & more
brew "vfox"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Memory training application
cask "anki"
# Configuration manager for Claude Code, Codex, Gemini CLI, OpenCode and OpenClaw
cask "farion1231/ccswitch/cc-switch"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono"
cask "font-open-sans"
cask "font-sf-mono"
cask "font-source-code-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
cask "tsung-ju/iguanatexmac/iguanatexmac"
# Free and open-source media player
cask "iina"
cask "tsung-ju/iguanatexmac/latexit-metadata"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open-source download manager
cask "motrix"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Rime input method engine
cask "squirrel-app"
# Quicklook extension for source files
cask "syntax-highlight"
# Open-source code editor
cask "visual-studio-code"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "antfu.icons-carbon"
vscode "antfu.open-in-github-button"
vscode "antfu.theme-vitesse"
vscode "antfu.where-am-i"
vscode "anthropic.claude-code"
vscode "azemoh.one-monokai"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "codeinchinese.englishchinesedictionary"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "fabiospampinato.vscode-open-in-github"
vscode "fisheva.eva-theme"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "guyutongxue.pause-console"
vscode "jeff-hykin.polacode-2019"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "liviuschera.noctis"
vscode "lokalise.i18n-ally"
vscode "luqimin.tiny-light"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "rafapaulin.try-material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "tonybaloney.vscode-pets"
vscode "usernamehw.remove-empty-lines"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "wesbos.theme-cobalt2"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
